app/views/notifications/index.html.erb

INSERT INTO "notifications" ("title", "description", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdklf"], ["description", "asdklf"], ["active", "t"], ["created_at", "2020-11-20 13:14:35.231020"], ["updated_at", "2020-11-20 13:14:35.231020"]]
---
    <p><%= notification.description %><p>
    <p>Created At: <%= notification.created_at %> </p>

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    <%= if notification.company
        Company.find(notification.company).name