app/views/notifications/show.html.erb

<%= if @notification.company
    Company.find(@notification.company).name
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]