app/controllers/api/v1/notifications_controller.rb

            def show
                notification = Notification.find(params[:id])
---
SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]