app/controllers/api/v1/notifications_controller.rb

            def index
              render json: Notification.all
---
SELECT "notifications".* FROM "notifications"

            def show
                client = Client.find(params[:id])
                notifications = Notification.all
                client_notifications = notifications
                    .select { |notification| client.companies.include? notification.company }
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "notifications".* FROM "notifications"
SELECT "clients".* FROM "clients"

            def update
                notification = Notification.find(params[:id])
                notification.update(
                    params.permit(:title, :description)
                )
---
SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "notifications" SET "active" = $1, "title" = $2, "updated_at" = $3 WHERE "notifications"."id" = $4  [["active", "f"], ["title", "same everywhere"], ["updated_at", "2020-11-21 17:26:39.949935"], ["id", 14]]