app/controllers/notifications_controller.rb

SELECT "notifications".* FROM "notifications"
---
    def index
        @adminviewtitle = 'Admin view for all Notifications'
        @notifications = Notification.all

SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def show
        @notification = Notification.find(params[:id])

INSERT INTO "notifications" ("title", "description", "active", "created_at", "updated_at", "company") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Syngenta"], ["description", "was removed"], ["active", "t"], ["created_at", "2020-11-22 16:22:12.148429"], ["updated_at", "2020-11-22 16:22:12.148429"], ["company", 2]]
---
    def create
        @notification = Notification.new(notification_params)
        if(@notification.save)